export const survey = [
  {
    moment: 'event1',
    title: '0.01초 승부수',
    desc: '시간은 단 7초. 숨을 죽이고, 정확한 타이밍을 노려라. \n 절체절명의 그 순간, 당신의 손끝이 승리를 결정한다!',
    img: 'onBoardIcn1',
    questions: [
      {
        id: 1,
        question: ' 이 이벤트에서 가장 기억에 남는 순간은 언제였나요?',
        options: [
          '스파이크 해체 직전, \n카운트다운 소리와 진동이 울릴 때 ',
          '내 손으로 스파이크 ‘해체’에 성공했을 때 ',
          '함께 참여한 친구(혹은 옆 참가자)와 \n반응을 공유한 때',
          '특별히 기억나는 순간은 없다',
        ],
      },
      {
        id: 2,
        question: '이 이벤트를 통해 당신이 체감한 감정은 어떤 것이었나요?',
        options: [
          '손에 땀을 쥐는 몰입감',
          '해체 성공의 쾌감',
          '실패의 아쉬움과 분함',
          '별다른 감정이 없었다 ',
        ],
      },
      {
        id: 3,
        question: '이 이벤트가 긍정적인 경험으로 다가왔나요?',
        options: [
          '매우 그렇다 – 게임으로\n직접 경험하고 싶다',
          '그렇다 – 발로란트가 \n어떤 게임인지 이해하게 됐다',
          '보통이다 – 특별히\n좋지도 나쁘지도 않았다',
          '아니다 – 기대에 미치지 못했다',
        ],
      },
      {
        id: 4,
        question:
          '이 이벤트를 통해 발로란트에 대해 더 알고 싶어진 부분이 있나요?',
        options: [
          '다른 요원의 스킬이나 세계관',
          '발로란트의 플레이 방식',
          '다양한 맵이나 전략 요소',
          '특별히 더 궁금한 것은 없다',
        ],
      },
    ],
  },
  {
    moment: 'event2',
    title: '내가 바로 원탭 전문가',
    desc: '조준점이 머리 위를 가를 때, 이미 게 임은 끝났다.\n 단 한 발로 판을 바꾸는, 그 짜릿함을 느껴보자!',
    img: 'onBoardIcn2',
    questions: [
      {
        id: 1,
        question: '이 이벤트에서 가장 기억에 남는 순간은 언제였나요?',
        options: [
          '훈련봇이 나타났을 때',
          '헤드샷을 성공시켰을 때',
          '계속 놓쳐서 집중력을 끌어올릴 때',
          '특별히 기억나는 순간은 없다',
        ],
      },
      {
        id: 2,
        question: '이 이벤트를 통해 당신이 체감한 감정은 어떤 것이었나요?',
        options: [
          '직접 조준해 맞췄을 때의 짜릿함',
          '몸이 먼저 반응하는 몰입감',
          '아쉽게 놓쳤을 때의 분함',
          '별다른 감정이 없었다',
        ],
      },
      {
        id: 3,
        question: '이 이벤트가 긍정적인 경험으로 다가왔나요?',
        options: [
          '매우 그렇다 – 다시 체험하고\n싶은 몰입감 있는 경험이었다 ',
          '그렇다 – 인상적인 \n순간들이 있는 경험이었다',
          '보통이다 – 해볼 만했지만 \n큰 인상은 없었다',
          '아니다 – 기대에 미치지 못했다',
        ],
      },
      {
        id: 4,
        question:
          '다음에 또 이런 체험이 있다면, 어떤 요소가 추가되면 더 재미있을 것 같나요?',
        options: [
          '훈련장이 아닌 발로란트 맵의 다양한 장소',
          '더 다양한 난이도의 훈련봇',
          '사진이나 영상으로 남길 수 있는 리플레이 기능',
          '굳이 추가되었으면 하는 건 없다',
        ],
      },
    ],
  },
  {
    moment: 'event3',
    title: '레전드 클러치 명장면',
    desc: '질 때까지 진게 아니다. 가능성은 열려 있다. \n마스터스 방콕을 뒤흔든 T1 메테오 선수의 클러치, \n그 전율을 직접 경험하라!',
    img: 'onBoardIcn3',
    questions: [
      {
        id: 1,
        question: '이 이벤트에서 가장 기억에 남는 순간은 언제였나요?',
        options: [
          '메테오 선수의 레전드 클러치 장면이 재생될 때',
          '영상 흐름에 맞춰 재미있는 퀴즈가 등장했을 때',
          '예상 외의 문제를 맞췄을 때',
          '특별히 기억나는 순간은 없다',
        ],
      },
      {
        id: 2,
        question: '이 이벤트를 통해 당신이 체감한 감정은 어떤 것이었나요?',
        options: [
          '메테오 선수의 시원한 플레이의 짜릿함',
          '퀴즈의 정답을 누를 때 긴장감',
          '발로란트에 대해 잘 아는 나 자신에 대한 뿌듯함',
          '별다른 감정이 없었다',
        ],
      },
      {
        id: 3,
        question: '이 이벤트가 긍정적인 경험으로 다가왔나요?',
        options: [
          '매우 그렇다 – 이스포츠 \n매력에 대해 느낄 수 있었다',
          '그렇다 – 발로란트의\n지식을 뽐낼 수 있었다',
          '보통이다 – 영상은 재밌었지만\n퀴즈가 조금 애매했다',
          '아니다 – 기대에 미치지 못했다',
        ],
      },
      {
        id: 4,
        question: '퀴즈의 난이도는 어땠나요?',
        options: [
          '쉬웠다',
          '적당했다',
          '어려웠다 – 게임을 하지만\n이스포츠를 잘 보지 않는다',
          '어려웠다 – 발로란트와\n이스포츠를 잘 모른다',
        ],
      },
    ],
  },
  {
    moment: 'event4',
    title: '오늘의 야.시장 운세',
    desc: '야시장에선 뭐든 가능하다. 유니크한 스킨, 극적인 순간,\n 지금 바로 가장 레어한 득템에 도전하자!',
    img: 'onBoardIcn4',
    questions: [
      {
        id: 1,
        question: '이 이벤트에서 가장 기억에 남는 순간은 언제였나요?',
        options: [
          '어떤 카드를 뒤집을지 고민할 때',
          '원하는 스킨을 뽑았을 때',
          '내가 뽑은 스킨의 포토카드를 받았을 때',
          '특별히 기억나는 순간은 없다',
        ],
      },
      {
        id: 2,
        question: '이 이벤트를 통해 당신이 체감한 감정은 어떤 것이었나요?',
        options: [
          '원하는 스킨을 뽑았을 때의 짜릿함',
          '원하는 스킨을 못 뽑았을 때의 아쉬움',
          '운에 맡겨야 하는 긴장감',
          '별다른 감정이 없었다',
        ],
      },
      {
        id: 3,
        question: '이 이벤트가 긍정적인 경험으로 다가왔나요?',
        options: [
          '매우 그렇다 – 야.시장 카드를\n실물로 가져갈 수 있어서 좋았다',
          '그렇다 – 짧지만 임팩트 있는 체험이었다',
          '보통이다 – 나쁘진 않았지만 아쉬움도 있었다',
          '아니다 – 크게 인상 깊진 않았다',
        ],
      },
      {
        id: 4,
        question:
          '다음에 또 이런 체험이 있다면, 어떤 요소가 추가되면 더 재미있을 것 같나요?',
        options: [
          '내가 원하는 스킨을 포토카드로 출력',
          '스킨 카드가 아닌 현장에서\n사용할 수 있는 상품 교환권/할인권',
          '나만의 스킨을 만들어보는 DIY',
          '현재도 만족스럽다,',
        ],
      },
    ],
  },
];
export const review = {
  questions: [
    {
      id: 1,
      question: '성별은 어떻게 되시나요?',
      options: ['남 ', '여 ', '기타'],
    },
    {
      id: 2,
      question: '연령대는 어떻게 되시나요?',
      options: [
        '10대 초반 (10-12)',
        '10대 중반 (13-15)',
        '10대 후반 (16-19)',
        '20대 초반 (20-22)',
        '20대 중반 (23-25)',
        '20대 후반 (26-29)',
        '30대 초반 (30-32)',
        '30대 중반 (33-35)',
        '30대 후반 (36-39)',
        '40대 이상 (40+)',
      ],
    },
    {
      id: 3,
      question: '현재 거주하시는 지역은 어디신가요?',
      options: ['서울', '경기도', '한국 내 기타 지역', '해외'],
    },
    {
      id: 4,
      question: '이번 발로란트 팝업 행사에 대해 어떻게 알게 되셨습니까?',
      options: [
        '발로란트 및 발로란트 공식 SNS 채널',
        '발로란트 5주년 플레이 이벤트 웹사이트',
        '팝업 홍보 전문 SNS 및 뉴스 채널',
        'DDP 쇼룸의 공식 SNS 채널 및 홈페이지',
        '인플루언서의 방송/콘텐츠를 통해',
        '친구/지인을 통해',
        '기타',
      ],
    },
    {
      id: 5,
      question: '발로란트 팝업에 방문하신 계기는 무엇입니까?',
      options: [
        '발로란트의 팬으로 방문',
        '친구/지인/가족의 추천으로',
        '인플루언서의 추천으로',
        '보상이벤트에 참여하고 싶어서',
        '평소 다양한 팝업에 대한 관심이 많아서',
        '새로운 게임을 경험해보고 싶어서',
        '근처를 방문/찾았다가 근처라서',
      ],
    },
    {
      id: 6,
      question: '발로란트 팝업 행사에서 진행한 경험에 대해 만족하십니까?',
      options: [
        '매우 만족함',
        '만족함',
        '보통',
        '만족하지 않음',
        '전혀 만족하지 않음',
      ],
    },
    {
      id: 7,
      question:
        '발로란트트 팝업을 방문/경험한 후, 발로란트에 대한 인식 변화가 있었나요? (최대 3가지)',
      options: [
        '더 많이/열심히 플레이 할 예정이다',
        '대세 게임을 플레이하고 있다는 느낌을 받았다',
        '브랜드가 더 세련되고 트렌디하게 느껴졌다',
        '기존 인식과 비슷했지만, 재미있는 경험이었다',
        '기대보다 평범해서 발로란트 이미지에 대한 큰 변화는 없었다',
        '이전보다 발로란트에 대한 관심이 줄어들었다',
      ],
    },
    {
      id: 8,
      question: '가장 만족스러웠던 행사 경험을 선택해주세요 (최대 3가지)',
      options: [
        '각종 경품',
        '스탬프 랠리 프로그램',
        '0.01초 승부수 - 스파이크 해체',
        '내가 바로 원탭 전문가 - 헤드샷',
        '레전드 클러치 명장면',
        '오늘의 야.시장 운세',
        '기타 존 : 사격장',
        '라이엇 스토어',
      ],
    },
    {
      id: 9,
      question: '향후 다른 발로란트 이벤트에 다시 방문할 의사가 있으신가요?',
      options: ['예', '아니오'],
    },
    {
      id: 10,
      question: 'FPS 게임을 생각하면 가장 먼저 어떤 게임이 떠오르십니까?',
      options: [
        '발로란트',
        'PUBG',
        '서든 어택',
        '카운터 스트라이크',
        '델타포스',
        '콜오브듀티',
        '오버워치',
      ],
    },
    {
      id: 11,
      question: '발로란트 게임을 이미 알고 계셨습니까?',
      options: ['예', '아니오'],
    },
    {
      id: 12,
      question: '발로란트 게임을 플레이 하십니까?',
      options: ['예', '아니오'],
    },
    {
      id: 13,
      question: '발로란트를 얼마나 자주 플레이 하십니까?',
      options: ['주 1-2회', '주 3-4회', '거의 매일', '하지 않음', '기타'],
    },
    {
      id: 14,
      question:
        '발로란트를 한 번 플레이할 때, 평균 플레이 시간은 얼마나 되십니까?',
      options: [
        '30분 미만',
        '30분 ~ 1시간',
        '1~ 2시간',
        '2~3시간',
        '3~4시간',
        '5시간 이상',
      ],
    },
    {
      id: 15,
      question: '보통 게임을 할 때 어떤 방식으로 플레이하시나요?',
      options: [
        '혼자 하는 것을 선호한다',
        '친구와 함께 하는 것을 선호한다',
        '모르는 사람이지만 커뮤니티에서 팀원을 찾아 함께 플레이한다',
        '상황에 따라 달라진다',
      ],
    },
    {
      id: 16,
      question:
        '가장 자주 즐겨 플레이하는 게임 모드는 무엇입니까? (최대 3개 선택)',
      options: [
        '일반전',
        '랭크전',
        '신속 플레이',
        '스파이크 돌격',
        '데스매치',
        '에스컬레이션',
        '팀 데스매치',
        '프리미어',
      ],
    },
    {
      id: 17,
      question:
        '발로란트를 플레이 하지 않는 친구, 가족, 동료에게 추천하실 의향이 있습니까?',
      options: ['예', '아니오'],
    },
    {
      id: 18,
      question: '발로란트 공식채널에 구독하셨습니까?',
      options: ['예', '아니오'],
    },
  ],
};
export const successMant = [
  {
    type: 'clear',
    title: 'CLEAR!',
    desc: '이벤트 참여를 완료하여<br/>스탬프를 획득하였습니다.<br/><br/><strong>간단한 만족도 조사 후 <br/>경품 교환소에서 경품을 수령하세요.</strong>',
  },
  {
    type: 'all-clear',
    title: 'ALL CLEAR!',
    desc: '<strong>발로란트 5주년 팝업에<br/> 준비된 체험을 완료 했습니다!</strong><br/><br/>앞으로도 많은 관심과 <br/>참여 부탁드립니다.',
  },
  {
    type: 'complete',
    title: 'COMPLETE!',
    desc: '<strong>만족도 조사를 완료 했습니다!.</strong><br/><br/>경품 수령을 위해 경품 교환소에 방문하고 스탭에게화면을 보여주세요.',
  },
];
