const data = [
  {
    id: 1,
    title: '개인정보 수집 및 이용 동의',
    desc: '라이엇게임즈코리아 유한회사는  발로란트 5주년 팝업 "내가 발로란트를 플레이하는 이유"의 스탬프 랠리 (이하 “이벤트”)를 진행함에 있어 본 “이벤트”의 참가자(이하 “참가자”)의 소중한 개인정보를 아래와 같이 수집 및 이용하며, 다음의 [개인정보 수집 및 이용 동의]를 상세히 읽어 보신 후 해당 내용에 동의하시는 경우에만 본 “이벤트” 참가 신청을 해주시기 바랍니다. 본 동의서에 명시되지 않은 내용에 대해서는 라이엇 게임즈 개인정보 처리방침(https://legal.kr.riotgames.com/privacy)에 따라 적용됩니다.\n' +
      ' \n' +
      '[개인정보 수집 및 이용 동의]\n' +
      '・수집 주체 : 라이엇게임즈코리아 유한회사\n' +
      '・수집 항목 및 목적\n' +
      '(필수)“참가자”의 이름, 휴대전화번호  - 본인 확인, \n' +
      '   “이벤트” 안내 및 당첨자 경품 제공 목적\n' +
      '(필수)“참가자”의 성별, 나이 - 설문 조사 및 결과 분석 목적\n' +
      '보관기간 및 파기방법 : 본 "이벤트"종료 후 사후 결과 검토를 위해 7월 30일까지 보관하며, 목적 달성 후 복구 불가능한 방법으로 지체 없이 파기합니다.\n' +
      '・거부 시 불이익 : 본 개인정보 수집 및 이용에 거부하실 수 있는 권리가 있으나, 거부 시 본 “이벤트” 참가가 제한될 수 있습니다.',
  },
  {
    id: 2,
    title: '개인정보 처리 위탁에 대한 고지',
    desc: '라이엇게임즈코리아 유한회사는  발로란트 5주년 팝업 "내가 발로란트를 플레이하는 이유"의 스탬프 랠리 (이하 “이벤트”)를 진행함에 있어 본 “이벤트”의 참가자(이하 “참가자”)의 소중한 개인정보를 아래와 같이 수집 및 이용하며, 다음의 [개인정보 처리 위탁에 대한 고지]를 상세히 읽어 보신 후 해당 내용에 동의하시는 경우에만 본 “이벤트” 참가 신청을 해주시기 바랍니다. 본 동의서에 명시되지 않은 내용에 대해서는 라이엇 게임즈 개인정보 처리방침(https://legal.kr.riotgames.com/privacy)에 따라 적용됩니다.\n' +
      ' \n' +
      '[개인정보 처리 위탁에 대한 고지]\n' +
      '위탁업체명 및 위탁 목적\n' +
      '・위탁업체 : ㈜디에이블크리에이티브\n' +
      '위탁 목적 : “이벤트” 운영 대행\n' +
      '・위탁업체 : ㈜브라이트벨크리에이티브그룹\n' +
      '위탁 목적 : “이벤트” 운영 대행 ',
  },
];


export default data;